Fuentes/ficohsacore-osb12-b78f21b126d5/Applications/RequestorServices/v1.0/HN/GetTicket/WSDL/GetTicket_PS.wsdl

<definitions targetNamespace="urn:AchSoapRouter_PS" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="urn:AchSoapRouter_PS" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:inp1="http://www.ficohsa.com.hn/middleware.services/achServicesPS" xmlns:dtt="http://www.ficohsa.com.hn/middleware.services/commonTypes" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
    <xsd:schema targetNamespace="urn:AchSoapRouter_PS/types" elementFormDefault="qualified"/>
        <xsd:schema>
            <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/achServicesPS" schemaLocation="../../../../../../MWBanking/Ach/RequestorServices/v1.0/AchSoapRouter/XSD/achTypes.xsd"/>
        </xsd:schema>
        <xsd:schema>
            <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/commonTypes" schemaLocation="../../../../../../CommonResources/XSD/CommonTypes.xsd"/>
        </xsd:schema>
  </types>
  
    <!-- DoEcho Messages -->
  
    <!-- GetTicket Messages -->
    <message name="getTicketRequest">
        <part element="inp1:GetTicketRequest" name="parameters"/>
        <part element="dtt:RequestHeader" name="RequestHeader"/>
    </message>
    <message name="getTicketResponse">
        <part element="inp1:GetTicketResponse" name="parameters"/>
        <part element="dtt:ResponseHeader" name="ResponseHeader"/>
    </message>
  
    <!-- SendCredit Messages -->
  
    <!-- GetTransactionsStatus Messages -->
  
    <!-- GetReportTransaction Messages -->
  
  <portType name="AchSoapRouter_PS_ptt">
    <operation name="GetTicket">
      <input message="tns:getTicketRequest"/>
      <output message="tns:getTicketResponse"/>
    </operation>
  </portType>
    <binding name="AchSoapRouter_PS_ptt-binding" type="tns:AchSoapRouter_PS_ptt">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="GetTicket">
            <soap:operation style="document" soapAction="urn:AchSoapRouter_PS/GetTicket"/>
            <input>
                <soap:body use="literal" parts="parameters"/>
                <soap:header message="tns:getTicketRequest" use="literal" part="RequestHeader"/>
            </input>
            <output>
                <soap:body use="literal" parts="parameters"/>
                <soap:header message="tns:getTicketResponse" use="literal" part="ResponseHeader"/>
            </output>
        </operation>
    </binding>
</definitions>